hit_state_num = [
    17,  # 屈ガード
    18,  # 立ガード
    19,  # 空中ガード
    26,  # 立吹っ飛び
    29,  # 足払いやられ
    30,  # 垂直吹っ飛び
    350,  # 投げやられ
    354,  # 小バウンド
    900,  # 立やられ
    901,  # 立やられ
    902,  # 屈やられ
    903,  # やられ
    904,  # やられ
    905,  # 屈大やられ
    906,  # 立大やられ
    907,  # 立大やられ２
    908,  # 屈大やられ2
]

# guard_state_num = [
#     17,  # 屈ガード
#     18,  # 立ガード
#     19,  # 空中ガード
# ]

ignore_state_num = [0, 10, 11, 12, 13, 14, 15, 20, 16, 594]

jump_state_num = [34, 35, 36, 37, 38, 39, 40, 54, 476]
